{
    "post": {
        "id": "mit-splash-2017",
        "date": "February 21st, 2018",
        "title": "MIT Splash 2017!",
        "content": "<p><a href=\"https://esp.mit.edu/learn/Splash/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">MIT Splash</a> is a weekend program where MIT students teach classes on literally any topic for high schoolers. This past year (sorry for the late post!), I taught an intro class on ReactJS, and I was pretty happy with how it went, so I wanted to do a quick write up here (including a tutorial at the bottom).</p><h3><span>Preparing A Class</span></h3><p>I was originally planning on creating an example application for the class and having the class follow along as we built the app up from the scratch. After thinking about the various basic topics that I wanted to teach and how to best demonstrate them, however, I realized that the <a href=\"https://reactjs.org/tutorial/tutorial.html\"  rel=\"noopener noreferrer\" target=\"_blank\">example tic-tac-toe app</a> that Facebook provides is perfectly suited to demonstrate all the foundational concepts that make React so exciting. So, I decided instead to prepare a good presentation that follows this tutorial and to explain each concept thoroughly as we came upon it in the example application. I figured this would still add value to independently following the tutorial as it would let me explain difficult concepts (e.g. unidirectional data flow) in greater detail and allow the students to ask questions. This turned out to be true, as my students asked me many questions that were not directly addressed in the tutorial (and indeed, which I hadn’t thought of myself).</p><p>In addition, I prepared a detailed explanation of how to set up the development environment because it is <a href=\"https://hackernoon.com/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f\"  rel=\"noopener noreferrer\" target=\"_blank\">extremely nontrivial</a> to get even a minimal setup to go from React code to a functioning website (and that link was 2 years ago!). I went with the create-react-app package as it would abstract away most of the specific tools and workflow (e.g. transpiling, packaging, linting, etc.) and allow us to focus on code. I did, however, plan out time to explain further time to explain these ideas and point the students to further resources to learn exactly how we go from code to product.</p><p>Overall, preparing the class turned out to be reasonably quick (~2 hours), as I just went with a PowerPoint that listed the key topics and made sure that I reviewed the topics so I could field questions about them the next day.</p><h3><span>Teaching A Class</span></h3><p>The day of the event was a bit hectic as I had been planning on a Linux environment (and all my instructions were based on this assumption), but the lab I was put in had Windows machines; worse, they didn’t have sufficient rights to install any software. This completely threw off my plan, as we couldn’t install Node (there are ways to run Node as a local user, but I thought getting that set up for each student would completely sidetrack us from the main goal of learning React). Luckily, Facebook came to the rescue once again, and I just explained the idea of setting up an environment and then had the students work on the online CodePen that is set up to follow the React tutorial.</p><p>While teaching, I began suspecting that many of the students were getting lost, but also were too shy or embarrassed to ask for further clarification (although I did stop after each slide to check if the students had any questions). My suspicions were confirmed when one student finally began asking questions, and after that, the students began asking more frequently about confusing topics. One particularly confusing topic was unidirectional data flow, which I diagrammed on the blackboard to show how the UI is always a visual representation of the current state.</p><p>Overall, teaching was pretty fun after the few hiccups in setup because explaining topics that I find interesting and conveying the reason for their usefulness is exciting. </p><h3><span>A Class</span></h3><p>As promised, here is the actual tutorial! Hopefully you found my ramblings above interesting, or at least short enough to skip over. One thing that becomes quickly evident when trying to teach/learn web development is that it’s really useful (maybe even necessary) to have a pretty good grasp over basic JavaScript and (importantly) ES6. So, before going over this tutorial, it might be a good time to head over to <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript\"  rel=\"noopener noreferrer\" target=\"_blank\">the MDN tutorials</a> and refresh your JavaScript.</p><p>Check out the PowerPoint <a href=\"//rahulyesantharao.com/blog-posts/assets/react-tutorial.pdf\"  rel=\"noopener noreferrer\" target=\"_blank\">here</a> and follow along at <a href=\"https://reactjs.org/tutorial/tutorial.html\"  rel=\"noopener noreferrer\" target=\"_blank\">the Facebook React Tutorial.</a></p><p>Check back soon for a more detailed tutorial!</p>"
    }
}